[
    "What have you created that you are most proud of?", 
    "What's the best thing you got from one of your parents?", 
    "What bends your mind every time you think about it?", 
    "In your group of friends, what role do you play?", 
    "What incredibly strong opinion do you have that is completely unimportant in the grand scheme of things?", 
    "What's your favorite piece of clothing you own?",
    "What fictional place would you most like to go to?", 
    "What's one place you've travelled that you never want to go back to?", 
    "When people come to you for help, what do they usually want help with?", 
    "What are you interested in that most people haven't heard of?", 
    "Mountains or ocean?",
    "What was your best birthday?", 
    "Pizza or tacos?",
    "What's the story behind one of your scars?",
    "Pancakes or waffles?", 
    "Pirates or ninjas?",
    "What was the best compliment you've ever received?",
    "If you lost all of your possessions but one, what would you want it to be?", 
    "Who inspires you to be better?", 
    "What dumb accomplishment are you most proud of?", 
    "When was the last time you changed your opinion about something major?",  
    "What is something you can never seem to finish?",
    "What is one of your favorite smells?", 
    "If you had to change your name, what would you change it to?", 
    "What are you a natural at?", 
    "What do you like most about your family?",
    "Have you ever saved someone's life?",
    "What's an unpopular opinion you have?", 
    "Who is one of your best friends, and what do you love about them?",
    "Do you have any nicknames?",
    "What's one of your favorite comfort foods?",
    "What is your theme song?",
    "What is one of the great values that guides your life?",
    "What's your favorite book?",
    "What's the last book you gave up on and stopped reading?",
    "What's the worst movie you've ever seen?",
    "What issue will you always speak your mind about?",
    "What would you do on a free afternoon in the middle of the week?",
    "Pet peeves?",
    "What's the best piece of advice you ever received?",
    "Who was your favorite teacher and why?",
    "If you could have any superpower, what would it be and why?",
    "What's on your bucket list this year?",
    "If you could live in a book, TV show, or movie, what would it be?",
    "What languages do you speak?",
    "Would you rather be stuck on a broken ski lift or a broken elevator?",
    "If you were a vegetable, what vegetable would you be?",
    "What makes you cry?",
    "Who are some of your heroes?",
    "What's something you wish you'd figured out sooner?",
    "What's your favorite candy?",
    "What's your worst habit?",
    "Favorite city?",
    "What's your go-to dance move?",
    "Do you ever sing when you're alone? What songs?",
    "What's your earliest memory?",
    "What's something you learned in the last week?",
    "What story does your family always tell about you?",
    "What talent would you show off in a talent show?",
    "Why haven't you done it yet?",
    "If you could have the attention of the world for one minute, what would you say?",
    "Has someone ever done a random act of kindness to you?",
    "What's the next line to cross off your list?",
    "If there are 100 people, how many would be more patient than you?",
    "In emergency situations, how do you react?",
    "What's your favorite room in your house and why?",
    "What's the story behind your last rant?",
    "What's the strangest situation you ever found yourself in?",
    "Do you have a favorite brand?",
    "What's something that is common today that humans will be embarrassed about doing in 50 years?",
    "What's something that was completely out-of-character that you did?",
    "If you were to be famous for something, what would that be?",
    "What is the messiest situation you've ever encountered?",
    "What's your current biggest worry?",
    "What book or movie character can you see in your own life?",
    "Do you consider telling white lies to be okay?",
    "Would the world be better or worse if superheroes existed?",
    "What have you done that you didn't like, but would you be willing to give it another shot?",
    "What uncommon thing would you encourage everyone to try once?",
    "What do you spend too much time doing?",
    "What's the last thing you complained about?",
    "What do you know is bad for you but you continue to do it anyway?",
    "What's the most difficult thing that you still do each day?",
    "Have you been given any good advice lately?",
    "What about you do you seem to get the most comments about?",
    "What do you remember most about your first crush?",
    "What is your current go-to song to dance to when nobody is around?",
    "If you had an extra hour a day that had to be allocated to one specific purpose, how would you use it?",
    "What is the funniest false thing you were able to convince others that's true?",
    "What's something that you would be willing to stay up all night to do?",
    "What's your opinion on social media?",
    "Have you evet taken a long shot that worked out?",
    "Does your family have any weird traditions?",
    "How long does it take you to form an opinion about a person?",
    "What's the last goal you set for yourself that you accomplished?",
    "What was a situation where you literally did a doubletake?",
    "Of all the problems in the world, which one would you like to see solved first?",
    "What's the most uncomfortable situation you've ever found yourself in?",
    "What memory have you been thinking about a lot lately?",
    "What recent event have you seen that restored your faith in humankind?",
    "What has been your biggest financial mistake?",
    "If you knew you could live forever, how would you spend your days differently?",
    "What do you hope to be an expert about at some point in your life?",
    "What is the quickest way for you to lose respect for someone?",
    "If you could remove something that exists in this world forever, what would it be?",
    "If it's raining outside, what activity do you most want to do?",
    "Is there anything that most people find cute that creeps you out?",
    "If you could choose to be famous for something, what would it be?",
    "If you could lock someone up and throw away the key, would you and if so, who would that be?",
    "What's something that you find difficult, but you think in your mind it should be easy?",
    "What can you talk about for hours?",
    "What's your knowing just enough to be dangerous story?",
    "What was the best thing you learned in the past year?",
    "Has someone ever done a random act of kindness to you?",
    "What is the most recent life lesson you've learned?",
    "What do you think is your most creative ability?",
    "How often do you find yourself daydreaming?",
    "Do you have a moment in your life you wish you could relive?",
    "If you had to change the language you speak, which one would you choose?",
    "What's something uncomfortable but you feel everyone should experience at least once in their life?",
    "What was the last thing that truly disappointed you?",
    "What is something you own that you have never used?",
    "If you were to be famous for something, what would that be?",
    "What thing from childhood do you still enjoy to this day?",
    "How do you best like your ice-cream?",
    "What little thing instantly tells you that a person is good?",
    "Have you ever had a terrible house guest? If so, what happened?",
    "Do you have any memories before the age of five?",
    "What's something interesting about you that few people know?",
    "What do you see happening in your future?",
    "Do you think you were ever part of the popular crowd?",
    "Do you consider yourself an introvert or an extrovert?",
    "What's the best compliment you ever received?",
    "If someone were to sum you up with a phrase, what would that phrase be?",
    "What have you recently felt grateful for?",
    "Is there a part of your culture that you don't like?",
    "What's a food you vow never to eat?",
    "What do you know how to do that's useless?",
    "What situation is sure to make you cry?",
    "What's your story about being under intense pressure and how did you handle it?",
    "Who have you met only one time that left a huge impression on you?",
    "Would the world be better or worse if superheroes existed?",
    "What is something that happened to you that you can't logically explain?",
    "What do you try to do to make the world a little better?",
    "If you had to describe your current life as a movie, which movie would you choose?",
    "What is your best shower thought?",
    "What have you recently realized you have been doing wrong?",
    "Have you ever had to complain to management? Why?",
    "What is something that someone does that will immediately turn you off?",
    "Where was your secret hiding place as a child?",
    "What recent thing have you decided that you're completely over and done with?",
    "Is there anything that makes you far angrier than it should?",
    "What is money to you?",
    "If you had the choice to go back in time or into the future, which would you choose?",
    "What's your most recent passion?",
    "What's the most interesting thing you have in your pockets right now?",
    "What's the most amount of money you've ever found? What was the situation?",
    "Who is someone you need to contact that you haven't?",
    "What type of exercise do you like most?",
    "If you were handed $500 at this moment, how would you spend it?",
    "What is the most interesting class you've ever taken?",
    "Have you ever had a missed connection encounter?",
    "What's some small thing you recently noticed?",
    "Do you have any apps on your phone that you've never used?",
    "How well do you think you understand yourself?",
    "What does it mean to \"live a good life\" in your opinion?",
    "What is the messiest situation you've ever encountered?",
    "What's the last thing that you broke and how did it happen?",
    "What's a situation when you look back you should have gone ahead and done it?",
    "What do you find you recently spend a lot of time wondering about?",
    "What recent experience made you feel old?",
    "Have you ever been at an event that you think will one day be in history books?",
    "What was the last thing that truly disappointed you?",
    "What's the next line to cross off your list?",
    "Would you feel comfortable showing me the photos on your phone?",
    "What's your opinion on social media?",
    "What's the last thing that you gave up on? Are you happy or disappointed?",
    "What's something that you find difficult, but you think in your mind it should be easy?",
    "What's the last thing you complained about?",
    "What is socially acceptable today that you think won't be in 10 years?",
    "What do you spend too much time doing?",
    "If you were to be famous for something, what would that be?",
    "Are you currently going through any type of phase?",
    "Do you have a special project you're currently working on?",
    "What do you wish you had spent more time doing when you were younger?",
    "What type of exercise do you like most?",
    "What situation is sure to make you cry?",
    "What do you hope to be an expert about at some point in your life?",
    "If each person had a warning label, what would yours say?",
    "What's the biggest wager you've ever made?",
    "What's the story behind why you replaced the last phone you had?",
    "Where do you draw the line?",
    "If you had to change the language you speak, which one would you choose?",
    "What can you talk about for hours?",
    "What are your top five snacks?",
    "What's the most interesting conversation you eavesdropped on?",
    "If you could choose the way you became a hero, what would the circumstances be?",
    "What part of the human face do you look at when you talk to someone?",
    "Do you have a nightmare travel story?",
    "If you could change the color of one thing, what would it be and why?",
    "What's your favorite daily routine?",
    "On any given day, what do you think you spend the most time doing?",
    "If you had to ask yourself one question to get the most information out of you, what would that question be?",
    "If you could change one thing about your family, what would it be?",
    "Do you consider yourself an introvert or an extrovert?",
    "What is something that you would really like to try again?",
    "If you could change the length of each day to make it perfect for you, how many hours would it be?",
    "What was the last meltdown that you witnessed?",
    "Is there any place that you have no desire to visit? Why?"
]