[
 "What have you created that you are most proud of?", "What's the best thing you got from one of your parents?", "What bends your mind every time you think about it?", "In your group of friends, what role do you play?", "What incredibly strong opinion do you have that is completely unimportant in the grand scheme of things?", "What's your favorite piece of clothing you own?",
 "What fictional place would you most like to go to?", "What's one place you've travelled that you never want to go back to?", "When people come to you for help, what do they usually want help with?", "What are you interested in that most people haven't heard of?", "Mountains or ocean?",
 "What was your best birthday?", "Pizza or tacos?",
 "What's the story behind one of your scars?",
 "Pancakes or waffles?", "Pirates or ninjas?",
 "What was the best compliment you've ever received?",
 "If you lost all of your possessions but one, what would you want it to be?", "Who inspires you to be better?", "What dumb accomplishment are you most proud of?", "When was the last time you changed your opinion about something major?",  "What is something you can never seem to finish?",
 "What is one of your favorite smells?", "If you had to change your name, what would you change it to?", "What are you a natural at?", "What do you like most about your family?",
 "Have you ever saved someone's life?",
 "What's an unpopular opinion you have?", "Who is one of your best friends, and what do you love about them?",
 "Do you have any nicknames?",
 "What's one of your favorite comfort foods?",
 "What is your theme song?",
 "What is one of the great values that guides your life?",
 "What's your favorite book?",
 "What's the last book you gave up on and stopped reading?",
 "What's the worst movie you've ever seen?",
 "What issue will you always speak your mind about?",
 "What would you do on a free afternoon in the middle of the week?",
 "Pet peeves?",
 "What's the best piece of advice you ever received?",
 "Who was your favorite teacher and why?",
 "If you could have any superpower, what would it be and why?",
 "What's on your bucket list this year?",
 "If you could live in a book, TV show, or movie, what would it be?",
 "What languages do you speak?",
 "Would you rather be stuck on a broken ski lift or a broken elevator?",
 "If you were a vegetable, what vegetable would you be?",
 "What makes you cry?",
 "Who are some of your heroes?",
 "What's something you wish you'd figured out sooner?",
 "What's your favorite candy?",
 "What's your worst habit?",
 "Favorite city?",
 "What's your go-to dance move?",
 "Do you ever sing when you're alone? What songs?",
 "What's your earliest memory?",
 "What's something you learned in the last week?",
 "What story does your family always tell about you?",
 "What talent would you show off in a talent show?",
 "Why haven't you done it yet?",
 "If you could have the attention of the world for one minute, what would you say?",
 "Has someone ever done a random act of kindness to you?",
 "What's the next line to cross off your list?",
 "If there are 100 people, how many would be more patient than you?",
 "In emergency situations, how do you react?",
 "What's your favorite room in your house and why?",
 "What's the story behind your last rant?",
 "What's the strangest situation you ever found yourself in?",
 "Do you have a favorite brand?",
 "What's something that is common today that humans will be embarrassed about doing in 50 years?",
 "What's something that was completely out-of-character that you did?",
 "If you were to be famous for something, what would that be?",
 "What is the messiest situation you've ever encountered?",
 "What's your current biggest worry?",
 "What book or movie character can you see in your own life?",
 "Do you consider telling white lies to be okay?",
 "Would the world be better or worse if superheroes existed?",
 "What have you done that you didn't like, but would you be willing to give it another shot?",
 "What uncommon thing would you encourage everyone to try once?",
 "What do you spend too much time doing?",
 "What's the last thing you complained about?",
 "What do you know is bad for you but you continue to do it anyway?",
 "What's the most difficult thing that you still do each day?",
 "Have you been given any good advice lately?",
 "What about you do you seem to get the most comments about?",
 "What do you remember most about your first crush?",
 "What is your current go-to song to dance to when nobody is around?",
 "If you had an extra hour a day that had to be allocated to one specific purpose, how would you use it?",
 "What is the funniest false thing you were able to convince others that's true?",
 "What's something that you would be willing to stay up all night to do?",
 "What's your opinion on social media?",
 "Have you evet taken a long shot that worked out?",
 "Does your family have any weird traditions?",
 "How long does it take you to form an opinion about a person?",
 "What's the last goal you set for yourself that you accomplished?",
 "What was a situation where you literally did a doubletake?",
 "Of all the problems in the world, which one would you like to see solved first?",
 "What's the most uncomfortable situation you've ever found yourself in?",
 "What memory have you been thinking about a lot lately?",
 "What recent event have you seen that restored your faith in humankind?",
 "What has been your biggest financial mistake?",
 "If you knew you could live forever, how would you spend your days differently?",
 "What do you hope to be an expert about at some point in your life?",
 "What is the quickest way for you to lose respect for someone?",
 "If you could remove something that exists in this world forever, what would it be?",
 "If it's raining outside, what activity do you most want to do?",
 "Is there anything that most people find cute that creeps you out?",
 "If you could choose to be famous for something, what would it be?",
 "If you could lock someone up and throw away the key, would you and if so, who would that be?",
 "What's something that you find difficult, but you think in your mind it should be easy?",
 "What can you talk about for hours?",
 "What's your knowing just enough to be dangerous story?",
 "What was the best thing you learned in the past year?",
 "Has someone ever done a random act of kindness to you?",
 "What is the most recent life lesson you've learned?",
 "What do you think is your most creative ability?",
 "How often do you find yourself daydreaming?",
 "Do you have a moment in your life you wish you could relive?",
 "If you had to change the language you speak, which one would you choose?",
 "What's something uncomfortable but you feel everyone should experience at least once in their life?",
 "What was the last thing that truly disappointed you?",
 "What is something you own that you have never used?",
 "If you were to be famous for something, what would that be?",
 "What thing from childhood do you still enjoy to this day?",
 "How do you best like your ice-cream?",
 "What little thing instantly tells you that a person is good?",
 "Have you ever had a terrible house guest? If so, what happened?",
 "Do you have any memories before the age of five?",
 "What's something interesting about you that few people know?",
 "What do you see happening in your future?",
 "Do you think you were ever part of the popular crowd?",
 "Do you consider yourself an introvert or an extrovert?",
 "What's the best compliment you ever received?",
 "If someone were to sum you up with a phrase, what would that phrase be?",
 "What have you recently felt grateful for?",
 "Is there a part of your culture that you don't like?",
 "What's a food you vow never to eat?",
 "What do you know how to do that's useless?",
 "What situation is sure to make you cry?",
 "What's your story about being under intense pressure and how did you handle it?",
 "Who have you met only one time that left a huge impression on you?",
 "Would the world be better or worse if superheroes existed?",
 "What is something that happened to you that you can't logically explain?",
 "What do you try to do to make the world a little better?",
 "If you had to describe your current life as a movie, which movie would you choose?",
 "What is your best shower thought?",
 "What have you recently realized you have been doing wrong?",
 "Have you ever had to complain to management? Why?",
 "What is something that someone does that will immediately turn you off?",
 "Where was your secret hiding place as a child?",
 "What recent thing have you decided that you're completely over and done with?",
 "Is there anything that makes you far angrier than it should?",
 "What is money to you?",
 "If you had the choice to go back in time or into the future, which would you choose?",
 "What's your most recent passion?",
 "What's the most interesting thing you have in your pockets right now?",
 "What's the most amount of money you've ever found? What was the situation?",
 "Who is someone you need to contact that you haven't?",
 "What type of exercise do you like most?",
 "If you were handed $500 at this moment, how would you spend it?",
 "What is the most interesting class you've ever taken?",
 "Have you ever had a missed connection encounter?",
 "What's some small thing you recently noticed?",
 "Do you have any apps on your phone that you've never used?",
 "How well do you think you understand yourself?",
 "What does it mean to \"live a good life\" in your opinion?",
 "What is the messiest situation you've ever encountered?",
 "What's the last thing that you broke and how did it happen?",
 "What's a situation when you look back you should have gone ahead and done it?",
 "What do you find you recently spend a lot of time wondering about?",
 "What recent experience made you feel old?",
 "Have you ever been at an event that you think will one day be in history books?",
 "What was the last thing that truly disappointed you?",
 "What's the next line to cross off your list?",
 "Would you feel comfortable showing me the photos on your phone?",
 "What's your opinion on social media?",
 "What's the last thing that you gave up on? Are you happy or disappointed?",
 "What's something that you find difficult, but you think in your mind it should be easy?",
 "What's the last thing you complained about?",
 "What is socially acceptable today that you think won't be in 10 years?",
 "What do you spend too much time doing?",
 "If you were to be famous for something, what would that be?",
 "Are you currently going through any type of phase?",
 "Do you have a special project you're currently working on?",
 "What do you wish you had spent more time doing when you were younger?",
 "What type of exercise do you like most?",
 "What situation is sure to make you cry?",
 "What do you hope to be an expert about at some point in your life?",
 "If each person had a warning label, what would yours say?",
 "What's the biggest wager you've ever made?",
 "What's the story behind why you replaced the last phone you had?",
 "Where do you draw the line?",
 "If you had to change the language you speak, which one would you choose?",
 "What can you talk about for hours?",
 "What are your top five snacks?",
 "What's the most interesting conversation you eavesdropped on?",
 "If you could choose the way you became a hero, what would the circumstances be?",
 "What part of the human face do you look at when you talk to someone?",
 "Do you have a nightmare travel story?",
 "If you could change the color of one thing, what would it be and why?",
 "What's your favorite daily routine?",
 "On any given day, what do you think you spend the most time doing?",
 "If you had to ask yourself one question to get the most information out of you, what would that question be?",
 "If you could change one thing about your family, what would it be?",
 "Do you consider yourself an introvert or an extrovert?",
 "What is something that you would really like to try again?",
 "If you could change the length of each day to make it perfect for you, how many hours would it be?",
 "What was the last meltdown that you witnessed?",
 "Is there any place that you have no desire to visit? Why?",
 "Who told you that about me?",
 "When was the last time you cleaned your room?",
 "Do these pants make my butt look big?",
 "Can a ferret eat cupcakes?",
 "Will I ever know who my father is?",
 "Is Hans Zimmer the greatest composer of our generation?",
 "How will I ever live this down?",
 "What time will you be coming over?",
 "How will I be able to read all of these?",
 "What was he thinking?",
 "What is the square root of 1000?",
 "Can you believe he hit on me?",
 "Can you please stand over there?",
 "How should I know?",
 "What's in the box?",
 "Do you know what an A.R.G is?",
 "Why did my dog have to run away?",
 "Where did you find my dog?",
 "Why does my cat climb in the bathtub?",
 "If the 7-11 is open 24 hours a day, 365 days a year, why does it have locks on the door?",
 "What would be the first thing you would do if your husband went out of town on a business trip?",
 "Why is it called a funny bone, when if you hit it, it's not funny at all?",
 "How many children would The Groom like to have?",
 "If your house was on fire and you could grab only 5 things before leaving, what would they be?",
 "Your wife is waiting at the doctor's office. Which magazine will she read? Scientific American, Good Housekeeping, People, Field and Stream, Glamour?",
 "Why is it that people say they \"slept like a baby\" when babies wake up 10 times every hour?",
 "Why is it building \"buildings\", shouldn't they be called a \"built\" when completed?",
 "What is the most bizarre gift your husband ever gave you?",
 "What belief do you have that most people disagree with?",
 "What is the capital city of Spain? Madrid.",
 "If one song were to describe your life, which song would that be?",
 "Whuts the deal with Chicken McNuggets? What part of the chicken are these things from?",
 "Have you had any difficult issues in your sexual past?",
 "How would you introduce yourself to the opposite sex?",
 "Why do you go \"back and forth\" to town if you really must go forth before you go back?",
 "What's your favourite sport beginning with the letter S?",
 "Have you ever said \"I love you\" but you didn't mean it?",
 "What is your biggest wish for this year?",
 "Describe The Character Of The Person You Would Like To Date?",
 "What is your favorite food with them?",
 "Which are your favorite smells?",
 "Do you have a garden?",
 "Which one of your habits would your wife like you to break?",
 "Do they have the word \"dictionary\" in the dictionary?",
 "What is something you've always wanted to try but have been too scared to?",
 "Why do they make scented toilet paper?",
 "Do You Like Curly Hair Or Straight Hair?",
 "Would you rather eat poison ivy or a handful of bumblebees?",
 "What food is your husband's favorite to snack on at night?",
 "It is more worthwhile and satisfying to improve the world or appreciate the world?",
 "If you could speak any language you want to speak, what would it be and why?",
 "Your favourite aunt/uncle/cousin and why?",
 "What's your favorite thing to do on a Saturday night?",
 "What's your favourite precious stone?",
 "If you had to choose between intelligence and common sense, which would you choose and Why?",
 "When should you introduce your boyfriend/girlfriend to your parents?",
 "Which is the song that makes you cry?",
 "How will this pageant help you develop as a person?",
 "Bruce Willis played a time travelling criminal in what movie? Twelve Monkeys",
 "When we get a woman President, will her husband be the First Man?",
 "If so...favorite book(s)?",
 "Do You Have College Plans?",
 "Do bald people get Dandruff?",
 "What was the most watched UK TV programme of all time? Eastenders, when Den divorced Angie, which drew 10 million viewers on 25th December,",
 "Which of these is your husband's favorite: music, wine or women?",
 "What features make a natural area beautiful?",
 "What was the name of your first pet?",
 "Do you love wild sex?",
 "After Me, Who Is Your Closest Female Friend? (Excluding Your Mother, And Other Family Members)",
 "Are you much of an adventurer?",
 "Would you rather go to an amusement park or to a family reunion?",
 "Why can't women put on mascara with their mouth closed?",
 "Would it make you upset if you saw me making out with a really hot woman?",
 "What do you usually smell like?",
 "If deserted on an island, what three things would you want and why would you choose them?",
 "What do you do to cool down when its hot?",
 "What is your best physical attribute? (Then, you can dare the person to show you their best physical attribute.)",
 "Give The Names Of 3 People You Love Most And Why?",
 "How can something be \"new\" and \"improved\"? if it's new, what was it improving on?",
 "Do you cry easily?",
 "How often do you find sex boring?",
 "Do you think Great Britain should have a National Day?",
 "What's wrong with being \"over the hill\"? Isn't downhill easier?",
 "Why do we still call it \"shipping\" when it goes by plane and truck?",
 "Do you like Oranges?",
 "Would you rather lose all of your memories from birth to now or lose your ability to make new long term memories?",
 "Would you like to imagine that I am a black panther and you are a poor hunter?",
 "What would you consider \"the perfect date\" for you?",
 "What do you do on weekends?",
 "What is your guilty pleasure Disney movie?",
 "What qualities are you looking for in a girlfriend?",
 "If you went out for drinks, what would be the first beverage The Groom would order?",
 "Imitate how your spouse behaves when they get angry.",
 "Favorite animal to have as a pet?",
 "When you were a kid, what did you want to be when you grew up?",
 "What quote or saying do people spout but is complete BS?",
 "What is a creative gift you have given or received?",
 "Which dish would your wife say is your favorite?",
 "and did you win?",
 "Does your spouse prefer a bikini or one-piece swimsuit? Which do you prefer?",
 "How far would you go with someone that you just met?",
 "Why is it called tourist season if we can't shoot at them?",
 "Do you find yourself attractive?",
 "When did you have your first fight and what was it about?",
 "Why can't you get a tan on your palms?",
 "What is the best vacation you have ever been on?",
 "Do you love or loathe Eurovision?",
 "Why are his-and-her presents always for her?",
 "When did you first know you were in love?",
 "What's your favourite non alcoholic drink beginning with the letter O?",
 "What is your favorite family memory?",
 "Have you ever not made it to the bathroom in time and had an \"accident?\"",
 "How many valentines cards did you receive this/last year?",
 "Have you ever been bobbing for apples?",
 "Do You Have Any Bad Habits?",
 "Which song would you dedicate to him / her?",
 "Have you ever imagined a world without hypothetical situations?",
 "What does your own personal hell look like? How about your own personal heaven?",
 "Where are 3 places you would like to visit on holiday and why?",
 "If you could live anywhere in the world, where would it be?",
 "What is your saddest memory?",
 "Have you ever slept in a caravan?",
 "What's a water moccasin often called, due to the white inside its mouth? A cottonmouth.",
 "What is your spouse's favorite flavor of ice cream?",
 "What you think, which outfit will suit me best?",
 "If you were to join an emergency service which would it be?",
 "Did Anyone Help You Figure Out How To Ask Me Out On A First Date?",
 "Which of your achievements are you most proud?",
 "How far would you go with someone that you just met?",
 "Why is it that to stop Windows 98, you have to click on Start?",
 "Would you rather meet an alien visitor or travel to outer space?",
 "Ever Had Plans And Broke Them?",
 "Is Carl's Junior a one-star restaurant?",
 "Could you ever be a medical guinea pig?",
 "How many Cell Phones do you own?",
 "How was your day?",
 "Have you ever been to a strip club? If you did, what was it like?",
 "What are your strengths?",
 "Which would you choose: money, or love?",
 "When someone is yelling at you in sign language, do you just close your eyes?",
 "If you could hear anyone in history give a speech, whom would you hear?",
 "What part of your body is the most sensitive – and how do you want me to touch it?",
 "So, do you really think we evolved from apes? Seriously?",
 "What is your favorite type of ball game?",
 "If you had to pick a car to describe you which one would it be?",
 "If you really could dig a hole to China, and you did, and you fell in, would you stop in the middle because of gravity?",
 "Do You Have Any Famous Relatives?",
 "Have You Ever Taken Any Anti-Depressants Or Anxiety Medication?",
 "Do your dreams ever tell you to do anything?",
 "What makes you nostalgic?",
 "Are you into toys or straps during sex?",
 "Are you introvert or extrovert?",
 "If I had to move far away for many years, would you wait for me?",
 "Have you ever walked out of a cinema before the film was done?",
 "If I melt dry ice, can I take a bath without getting wet?",
 "When was the last time you had a food fight?",
 "Which family member of yours does your spouse find most annoying?",
 "Name three things you have never done and don't want to do?",
 "What diets have you tried?",
 "If your husband had one day off to himself, what would he do?",
 "If you could change 4 things in the world, what would they be?",
 "What was the last Album you purchased?",
 "Democracy, good or bad?",
 "Have you ever cheated on your boyfriend/girlfriend?",
 "Are You In Touch With Friends From School/College? How Close Are You?",
 "Why is snow white and ice clear? Aren't they just different forms of water?",
 "Who in your family gives good gifts? How about bad gifts?",
 "How does a Real Estate company sell its office without causing confusion?",
 "Do you think my breasts are big and round enough?",
 "What shirt are you wearing?",
 "Have you succumbed to the seduction of an older woman ever? How old were you?",
 "What kind of job would you like to have?",
 "Is there any way for governments to avoid power corrupting its politicians? If so, how? If not, what part of human nature makes corruption unavoidable?",
 "Crowds Or Small Groups?",
 "Do You Read Newspapers?",
 "How would you like to be remembered?",
 "Who copyrighted the copyright symbol?",
 "What trajectory are you hoping to push yourself onto? Where do you want to head?",
 "If you could try out any job for a day, what would you like to try?",
 "If the prize for winning this game were a second honeymoon to any destination, where would you go?",
 "What's something you were really stressed about, it turned out to be no big deal?",
 "How often do you remember your dreams?",
 "Are you laid back or high strung?",
 "What time do you get up in the morning?",
 "Do You Have A Dream Job?",
 "Can you name all 50 American states?",
 "If you could work in any company in the world, what would it be and why?",
 "What's the first thing you notice about people?",
 "How many cities have you lived in?",
 "What job would you be absolutely terrible at?",
 "At What Age Do You Think That Dating Should Begin?",
 "If the #2 pencil is the most popular, why is it still #2?",
 "Who in the movie business seems the most down to earth?",
 "On a scale of 1-5 how organized are you?",
 "Mulberry bush aside, would a monkey really chase a weasel?",
 "What is the worst hotel you have stayed at? How about the best hotel?",
 "What is your favorite restaurant in town and why?",
 "Have you ever written a love letter?",
 "Which are your top bands or singers?",
 "Which is your favorite genre of movies?",
 "What do you like about him/her?",
 "What are some of your favorite movies?",
 "Are You More Like Your Mom Or Your Dad?",
 "What is the thing you love most about me?",
 "If you found out your current life has been just a dream, would you choose to wake up?",
 "When was the last time I was in one of your dreams?",
 "How often do you binge watch shows?",
 "If you could steal one thing without consequence what would it be?",
 "What living celebrity woman will your wife say she most admires?",
 "What movie won the best story Oscar in 1958? The Defiant Ones",
 "What is your wife's favorite - dark chocolate, milk chocolate, white chocolate, or jelly beans? Wives:",
 "What did people tease you about growing up?",
 "Do one legged ducks swim in circles?",
 "What is the one, single food that you would never give up?",
 "Are you a virgin? If not, how old were you when you lost your virginity?",
 "Complete the following sentence: \"A perfect wife is one who _____________\"",
 "Have you ever dated two girls at once without either of them being the wiser about it?",
 "Favorite hangout?",
 "Do You Maintain A Blog?",
 "What chokes you up when you think about it?",
 "How many speeding tickets have you received?",
 "Have you ever been so drunk that you blacked out?",
 "If today was the last day before the end of the world, how would you spend it?",
 "Which are your top bands or singers?",
 "Why is it that before 9/11 they always showed the emergency broadcast system test, and on 9/11 they never used it?",
 "How often do you remember your dreams?",
 "Are marbles made of marble?",
 "Have you ever done it on a boat/yacht?",
 "Has your mate ever called you at work to ask where the remote control is?",
 "Would you let me slap you for a hundred dollars?",
 "Have You Ever Cheated A Friend?",
 "What are your lucky numbers and why?",
 "Would you rather be hairy all over or completely bald?",
 "You can have one of the following two things: trust/love?",
 "Can you dream of having a dream?",
 "What sports do you like to watch?",
 "You're about to walk the green mile, what do you have as your last meal?",
 "Which color of lingerie your wife owns the most?",
 "Which one of you makes the final decision on important matters?",
 "What is your favorite month of the year?",
 "What was the name of Elizabeth Taylor's horse in the 1944 film National Velvet Pie",
 "Do You Like School?",
 "Where is a good pace to go on a date in this town?",
 "Have you ever been on a space hopper?",
 "What is the next big success you are working to?",
 "What is your favorite hairstyle on a man?",
 "Which fictional character would be the most boring to meet in real life?",
 "If you were offered the position of mayor of your city, would you take it?",
 "Who is the best cook?",
 "Would you rather live in the wilderness far from civilization or live on the streets of a city as a homeless person?",
 "Ever kissed someone below 14?",
 "How do you control your temper when you are angry?",
 "What's your favourite girls name beginning with the letter E?",
 "Give The Names Of 3 People You Love Most And Why?",
 "What's a question with no answer called?",
 "Do you consider yourself sexually open minded?",
 "What was it your spouse that made you realize that they were \"the one\"?",
 "Do you like going to family gatherings? Why or why not?",
 "Have you ever starred in an amateur or professional video?",
 "Have You Ever Taken Any Anti-Depressants Or Anxiety Medication?",
 "What unusual role did Bogart play in \"The Return of Doctor X\" in 1939? A Vampire",
 "Which season are you most active in?",
 "What color wig would you buy your wife?",
 "Which would you rather have if you had to, a broken leg or a broken arm?",
 "How many people thought of the Post-It note before it was invented but just didn't have anything to jot it down on?",
 "Can you play poker?",
 "Who is the better cook you or your wife?",
 "Would you rather eat rotten cheese or rotten eggs?",
 "Where do you like to go to on a first date?",
 "How many times have you gotten off in one night?",
 "Which part of a girl's body you like the most?",
 "Are humans fundamentally different than animals? If so, what makes us different?",
 "On a scale of 1-10 how awesome would you say you are?",
 "What's your most hardcore fantasy?",
 "Which future actor dropped out of college to be a dishwasher? Warren Beatty",
 "Which of your relatives bugs your husband the most?",
 "How long are you on the internet every day?",
 "Favorite song?",
 "When sign makers go on strike, is anything written on their picket signs?",
 "How does a shelf salesman keep his store from looking empty?",
 "How did you find out that Santa isn't real?",
 "What colour is Absynth? Green.",
 "Do you like vanilla or chocolate?",
 "Who, besides your parents, had the biggest impact on your life?",
 "What's your ideal girl/guy?",
 "What would your spouse request as a last meal?",
 "Do You Believe That He Will Always Have A Special Place In Your Heart?",
 "How Did Your Parents Meet?",
 "Describe yourself in five words or less?",
 "How tall are you exactly?",
 "How would you react if I was dating another guy or girl?",
 "Would you rather marry a vain person or a person with poor image?",
 "Is it okay if I hate your family but I love you?",
 "Would it make you upset if you saw me making out with a really hot woman?",
 "Who would you consider to be your hero?",
 "Where was your first kiss?",
 "Have you ever licked a battery?",
 "Who is the messiest in your house?",
 "Do you prefer to spend more time with your SO, family, or friends? Why?",
 "Where is your favorite place to go on a weekday afternoon when you have no plans or obligations?",
 "What was your last dream about?",
 "What movie made you cry the most?",
 "Do the English people eat English muffins, or are they just called muffins?",
 "Have you ever been bobbing for apples?",
 "What's the furthest you’ve ever been on holiday?",
 "How many times have you been in love?",
 "Ever had your heart broken?",
 "How would your wife describe you when you wake up in the morning: aggressive, chipper or grouchy?",
 "What color sheets do you have on the bed?",
 "What fact do you try to ignore?",
 "Which was your favourite science? Biology, Physics or Chemistry?",
 "Where did your last hug take place?",
 "Where would you find the world's most ancient forest? Daintree Forest, north of Cairns, Australia.",
 "If you could be an animal, which animal do you think you would be?",
 "William Hurt won the best actor Oscar for what 1985 movie? The Kiss of the Spiderwoman",
 "What was the last thing you said to someone?",
 "What movie won the best sound effects Oscar in 1987? Robocop",
 "Do You Like To Describe What You See In The Clouds?",
 "Besides food/water, medicine, or money what would be the most helpful thing to air drop to refugees of a war torn country?",
 "What's more important ... boobs or butt?",
 "Would you rather eat your favorite meal for every meal for the rest of your life or never be able to eat your favorite meal again?",
 "When if ever did you last go to london?",
 "What is your favorite disney movie?",
 "What was the last DVD you purchased?",
 "In 1995, what was Pierce Brosnan's first James Bond movie? Goldeneye",
 "Have you ever had a secret admirer",
 "Have you ever sold your services?",
 "Have you ever had a dream you chased only to be let down when you achieved it?",
 "What railway linked Moscow and Irkutsk in 1900? The Trans-Siberian Railway.",
 "Would you ever let your parents pick out a partner for you?",
 "Have you ever taken a personality test? (How did the results turn out?)",
 "What was the basis for the movie Die Hard? Walter Wagers novel 58 minutes",
 "How often do you curse?",
 "What are some of your favorite movies?",
 "What are the qualities that draw you to people that you can base a friendship on?",
 "Can you juggle?",
 "Ever broken any bones or been in an accident?",
 "If you could kill off any character from a current television show, who would it be?",
 "If the 7-11 is open 24 hours a day, 365 days a year, why does it have locks on the door?",
 "What is the most worthwhile goal a person can dedicate their life to?",
 "If a transvestite goes missing, would you put their face on a carton of Half and Half?",
 "Who would you say, has the better in-laws?",
 "Why are his-and-her presents always for her?",
 "Why is it considered necessary to nail down the lid of a coffin?",
 "Have you ever won a giant sized cuddly toy from a fair?",
 "Tell me about a sporting event you'll never forget",
 "What makes a person beautiful to you?",
 "Do You Like School?",
 "Have you ever ridden on a motorbike?",
 "Where is the lead in a lead pencil?",
 "Which is your favourite movie of all time? cq your favourite scene in it?",
 "Who is the dominating partner in the bedroom?",
 "Where is the best place to take a date?",
 "When and where was your wildest sex ever?",
 "Which form of public transport do you prefer?",
 "Would you like to have more relationships in the same time?",
 "If you had to choose between peace, love and happiness; what would you choose and why?",
 "If you were offered the position of mayor of your city, would you take it?",
 "Where would your dream vacation be?",
 "What behaviors make you think a person is creepy?",
 "If you could go to any place right now where would you go?",
 "What is the most challenging thing you have had to do this year?",
 "What is the best piece of advice you've ever received?",
 "How many slices of pizza are you capable of eating in one sitting?",
 "What's the worst and best thing about being female?",
 "Are you superstitious?",
 "If you met a Genie who offered you three wishes, what would you wish for? (more wishes does not count)",
 "For the girls: have you ever worn a jockstrap?",
 "Phyllis Nan Sortain Pechey was as famous for her flamboyant character as for her cookery books and TV show throughout the late 1960s to the mid 1970s. By what name was she more usually known? Fanny Cradock.",
 "Have You Had Any Difficult Issues In Your Past?",
 "If you had to coin a 1 sentence slogan for this pageant, what would it be?",
 "Is there another word for synonym?",
 "When lightning strikes the ocean why don't all the fish die?",
 "Do you moan? If so, are you loud or quite?",
 "What school activities do you or did you participate in?",
 "In your reign as title holder, how would you serve as a role model for children?",
 "When is your mother-in-law's birthday?",
 "What is The Groom's favourite holiday tradition?",
 "How tall are you?",
 "Which is your favourite part of the human face and why?",
 "Is your calendar always on the correct month (or day, if it is a day calendar)?",
 "How do you like your eggs cooked?",
 "Are you a good actor?",
 "What do you think about dating a friend's ex-girlfriend or ex-boyfriend?",
 "What living celebrity woman will your wife say she most admires?",
 "Ever Been Kissed Under Fireworks?",
 "Did You Go To Graduate School?",
 "What is your spouse's favorite TV show?",
 "How come abbreviated is such a long word?",
 "If you know you are not going to get caught, are you going to cheat on me?",
 "How long did you last phone call last?",
 "Seen anything weird lately?",
 "If Wile E coyote has enough money to by all that Acme crap why doesn't he buy his dinner?",
 "Would you say you are a good or bad influence to others?",
 "Who is the most impressive famous person alive today? Why?",
 "On what street did your spouse live on as a child?",
 "Have you ever had sex with your best friend's girlfriend?",
 "What's your favourite farmyard animal?",
 "Why is Charlie short for Charles if they are both the same number of letters?",
 "Do you watch the news on TV?",
 "If I could only wear yoga pants or short skirts for the rest of my life, what would you choose for me?",
 "Did they intentionally make grammar hard to spell?",
 "Been in a mosh pit?",
 "How many CDs and DVDs to you own?",
 "Do You Contribute To A Retirement Fund Of Some Kind?",
 "Do you like reading books or comics?",
 "When Atheists go to court, do they have to swear on the bible?",
 "On a scale of 1-10 how devilsh would you say you are?",
 "Why haven’t you done anything about those regrets?",
 "Are You A Lover Or A Fighter?",
 "Do you prefer the city or the country?",
 "If you didn't care at all what people thought of you, what clothes would you wear?",
 "What was your favorite subject in school?",
 "How would you describe yourself using 7 different words?",
 "Frank Sinatra, John Wayne, and Paul Newman all rejected which movie role ? Dirty Harry Callahan",
 "What's your favourite alcoholic drink?",
 "If you could bring back one famous person from the dead - who would you bring back & why?",
 "Which Has Been Your Best Vacation So Far? What Made It So Special?",
 "Why is the sky blue?",
 "Isn't it a little scary that a doctor's work is called practice?",
 "Is regular exercise important to you? Why or why not?",
 "Are you a virgin? If not, when did you lose your virginity?",
 "Ever Been In A Physical Fight? If Yes How Many And Who Were They With?",
 "List 3 of your best personality traits.",
 "Do you think all people are equally valuable, or do you think some people in certain situations might be more valuable than others (say, a severely retarded patient vs. a doctor who could potentially save hundreds of lives)?",
 "Do You Have Any Fertility Issues That You Are Aware Of?",
 "What is your wife's favorite salad dressing?",
 "Do You Think That The Pregnancy And Birth Process Are Important?",
 "How many people have you slept with?",
 "Do you still have feelings for an ex-intimate partner?",
 "Do you love wild sex?",
 "Do you love or hate roller coasters?",
 "Is poverty an inevitable byproduct of human society?",
 "What's your favorite season?",
 "Who was the first person to look at a cow and say \"I think i'll squeeze these dangly things here and drink what comes out\"?",
 "What is the biggest lesson you've learned from a failure?",
 "Describe Your Work Ethic?",
 "What's your favorite color?",
 "What movie do you wish life was more like?",
 "Which is your main ring tone on your phone?",
 "Have You Ever Been Part Of A Not-For-Profit Organization And Done Volunteer Work?",
 "If you are a magician, what part of my clothes that you would like to disappear? Ask him why?",
 "Which are your top bands or singers?",
 "Malden Serkiovitch used what name for his acting career? Karl Malden",
 "Would you rather never have to work again or never have to sleep again (you won't feel tired or suffer negative health effects)?",
 "If you could live in one city for the rest of your life, where would you live?",
 "Why does honey come in plastic bears and not plastic bees?",
 "What do you prefer, eating salsa or dancing it?",
 "What was the last song you listened to?",
 "Have you ever been attacked with a creamy bakery product?",
 "What is the best and worst part of your personality?",
 "What do we do now that will be looked at as primitive and backwards in 100 years? What event would you rather die than live through?",
 "Do you like TV talent shows?",
 "Which is your favourite pokemon?",
 "What gift that your spouse gave you came as the biggest surprise?",
 "Do fish ever get thirsty?",
 "Where is the most beautiful place near where you live?",
 "If someone told you they saw me with another guy, what would your first reaction be?",
 "Describe Your Childhood Days?",
 "Who is the dominating partner in the bedroom?",
 "You find a remote that can rewind, fast forward, stop and start time. What do you do with it?",
 "Why do we say we're head over heels when we're happy? Isn't that the way we normally are?",
 "Have you ever done it at your grandparent's?",
 "What do you like better hands or feet?",
 "How has the education you received changed your life?",
 "What's one of the strangest things you’ve ever done?",
 "If Heaven exists, what would you like to hear God say when you arrive at the Pearly Gates?",
 "Why does Goofy stand on two legs while Pluto remains on all fours? They're both dogs! If love is blind, why is lingerie so popular?",
 "What was the last thing that you fixed?",
 "What is the last thing you watched on TV?",
 "What's your favourite letter of the Alphabet?",
 "What's the weirdest place you've ever done it?",
 "What kind of music do you like best?",
 "What would your spouse say is his/her best and worst features?",
 "If your husband were home alone one night, what would he eat for dinner?",
 "Do you like spicy food? Why or why not? What is the spiciest thing you have ever eaten? What foods do you absolutely hate?",
 "How did you meet your spouse?",
 "Tell me about the worst punishment you had when you were a child?",
 "What size ring would you buy for your wife?",
 "Do You Believe In Life After Death?",
 "What do you bring with you everywhere you go?",
 "What's the most unusual thing you've ever eaten?",
 "If abandoned alone in the wilderness how would you survive?",
 "Ever tipped a cow?",
 "Can you solve sudoko puzzles?",
 "What's the craziest dare you've ever gone through with?",
 "Describe your mood right now using one word",
 "What is your favorite day and why?",
 "Why do guys love to have their balls fondled and played with?",
 "What old trend is coming back these days?",
 "Computer Geek?",
 "Which cartoon character would your spouse choose to be?",
 "Sylvester Stallone used to sweep out what for a living? Lions cages",
 "Did America really put a man on the moon?",
 "Which was your favorite story as a child?",
 "If you have three wishes free, what do you wish?",
 "If I melt dry ice, can I take a bath without getting wet?",
 "What's one of your favorite habits you have?",
 "Have you ever made love to a man/woman?",
 "American Idol fan?",
 "Body painting?",
 "Ever had a drunken night in Vegas?",
 "What is your idea of a perfect date?",
 "Are you a good and a sensual kisser?",
 "What's the closest thing to real magic?",
 "Do You Prefer Facebook, Twitter, Snapchat, Or Neither?",
 "Which three parts of my body are your personal favourites and why?",
 "Have you ever bought anything from ebay?",
 "Ever Been In Any Legal Trouble?",
 "If you could choose only one, which would you choose: to be smart, rich or beautiful? Why?",
 "What was your favorite book as a child?",
 "Do all-boys schools have girls bathrooms? Conversely, do all-girls schools have boys bathrooms?",
 "If you could walk chose an actor to play you as a character who would it be?",
 "What is the strangest themed restaurant you have heard of?",
 "Do You Love Children?",
 "How much do you use ketchup? (1 - not at all, 5 - on all foods)",
 "My spouse's first kiss made me think ________________.",
 "Do you regret going out with me?",
 "If one song were to describe your life, what song would it be?",
 "Have you ever had a crush on a friend's parent?",
 "Have you ever been on a pogo stick?",
 "If you could take a year off and go travelling, where would it be?",
 "How far would you go with someone that you just met?",
 "Are there any fears you have that you would like to get over?",
 "Have you ever been arrested?",
 "What profession other than your own would you like to attempt?",
 "Have you ever thought about a world without clocks?",
 "What is the least favorite thing about yourself?",
 "Does Your Partner Need To Go With You?",
 "Which emerging technology are you most excited about?",
 "Do You Like One Part Of The World/Country Best?",
 "Why do they call it a pair of pants, but only 1 bra?",
 "What's something most people don’t know about you?",
 "How would you introduce yourself?",
 "Can you remember who gave you the best sex of your life?",
 "Have You Ever Worn A Guy's Briefs?",
 "Tom Cruise's first box office film was called what? Risky Business",
 "Would you rather be fluent in all languages and never be able to travel or be able to travel anywhere for a year but never be able to learn a word of a different language?",
 "What film was the last sequel to win a best picture award? Silence of the Lambs",
 "What is your biggest goal in life?",
 "Why do we sing \"Take me out to the ball game,\" when we are already there?",
 "Are you a good employee?",
 "Who is the messiest person you know?",
 "If you could try out any job for a day, what would you like to try?",
 "Would your parents have a problem if you married someone much older or younger than you?",
 "What is the biggest lesson you've learned from a failure?",
 "Have you ever had your heart broken?",
 "Have you ever tie-dyed your own clothes?",
 "Would you rather always get first dibs or the last laugh?",
 "Would you rather always be 10 minutes late or always be 20 minutes early?",
 "What does your favorite fore-play include?",
 "Where do you like to go out to eat most?",
 "How do you feel about public speaking?",
 "What is the first thing you notice in the opposite sex?",
 "Why won't my bankruptcy attorney accept payments?",
 "Would you help me pick that outfit if I asked you to?",
 "If you woke up one day and found out your spouse had lost their memory, what would you do?",
 "If you won the lottery, what would you buy with the money?",
 "What level of importance must a person have, before they are considered assassinated instead of just murdered?",
 "Can you curl your tongue?",
 "Have you ever had sex in a public place (3)?",
 "If you get a beer belly by drinking beer, do you get a pot belly by smoking pot?",
 "Why do we put shirts in a suitcase, and put suits in a garment bag?",
 "When I walk away, do you keep your eye on me?",
 "Do you like spicy food?",
 "What is deeply unsettling?",
 "Do You Like To Have Boy Friend Or Girl Friend In Your School Or In Your Classes?",
 "Do you collect anything?",
 "When did you screw everything up, but no one ever found out it was you? was it something recent that you messed up and got away with?",
 "Husbands, if your wife could send you to a Body Repair Shop, what on you would she have fixed?",
 "Describe your own personal hell.",
 "What was the name of the Australian movie about the pianist Halstadt? Shine",
 "What's your favourite book beginning with the letter F?",
 "What does OK actually mean?",
 "What personality traits do you look for in a partner?",
 "What one item of clothing does your spouse wear that you just can't stand?",
 "What are better, violins or pianos?",
 "Want to marry your girlfriend just because she was pregnant?",
 "Have You Ever Kissed More Than One Girl In The Same Day?",
 "Would you prefer to go out with a quiet or a talkative person?",
 "What are some of the biggest challenges you have faced?",
 "Why do toasters always have a setting on them which burns your toast to a horrible crisp no one would eat?",
 "If you could change one thing about this pageant, what would it be? Why?",
 "Most prized possession you have?",
 "What is the most annoying personality trait someone can have?",
 "What is your favorite Wikipedia article? (Shuddup. Everyone has one.)",
 "Why do we sing \"Take Me Out to the Ballgame\" when we're already there?",
 "Who is more of a dancer types among you guys?",
 "Why do they call it \"getting your dog fixed\" if afterwards it doesn't work anymore?",
 "Do you prefer fiction or nonfiction books?",
 "What was your first smart phone? How did you feel when you got it?",
 "When I'm on top, what's your favorite position?",
 "Who or what inspires you to be a better person?",
 "Would you rather have x-ray vision or bionic hearing?",
 "If you had to describe yourself as a car, what would it be?",
 "Do you like to cook?",
 "What is your favorite drink and why?",
 "Did Anyone Help You Figure Out How To Ask Me Out On A First Date?",
 "Do you believe in life after death?",
 "Why are his-and-her presents always for her?",
 "Do stuttering people stutter when they're thinking to themselves?",
 "Do you talk to yourself?",
 "What is the most embarrassing thing you've ever done?",
 "What is the most impressive thing you know how to do?",
 "What's your biggest screw up in the kitchen?",
 "Do you wake up or open your eyes first?",
 "Does anybody ever vanish with a trace?",
 "Have you ever met a famous person?",
 "One thing from your partner's daily routine that they should stop doing?",
 "Ladies what would your husband say is your favorite outfit, excluding what you are wearing tonight.",
 "Is there something you've dreamed of doing for a long time?",
 "What's the best prank you've ever pulled?",
 "If you could be any animal, what would you be?",
 "In the Wizard of Oz, what was the name of the Good Witch of the North? Glinda",
 "What's the worst fast food restaurant?",
 "Name the brand of shoes you've recently worn.",
 "Do you keep a journal or maintain a blog?",
 "Do you prefer baths or showers?",
 "What personality traits make a good leader?",
 "If a guy that was about to die in the electric chair had a heart attack should they save him?",
 "If you saw someone drop a 拢10 note, would you claim it for your own or try to return it to them?",
 "Have you done anything overly extreme this year?",
 "Do you have a myspace?",
 "If money were not an object, what would you do with your life?",
 "What flavour is Cointreau? Orange.",
 "Can you describe your dream house?",
 "Which of these is your husband's favorite: music, wine or women?",
 "How come Superman could stop bullets with his chest, but always ducked when someone threw a gun at him?",
 "If your house caught on fire, what one thing would your spouse grab before leaving?",
 "How can technology improve education? Can it hurt education?",
 "What did Anna Maria Louisa Italiano change her name to? Anne Bancroft",
 "If you could bring back one famous person from the dead - who & why?",
 "Can you ice skate?",
 "Who was Sadie Hawkins?",
 "Do you chew on your straws?",
 "Are you scared of the dark?",
 "Do you love or loathe Eurovision?",
 "If you could describe your spouse in one word, what word would it be?",
 "Do you like rainy days or snowy winter days more?",
 "Which is the only American state to begin with the letter 'p'? Pennsylvania.",
 "Are you a good judge of character?",
 "Do you give money to buskers?",
 "Do You Like Me?",
 "Who is the most interesting person in your extended family?",
 "What's the worst movie you have seen recently?",
 "When was the last time your husband bought you flowers?",
 "What do you label yourself as?",
 "Who does your wife talk to on the phone the most?",
 "Do You Like Getting Wet In The Rain?",
 "Were you part of the Brownies/Cubs/Scouts/Guides etc",
 "Who is your wife's favorite actor?",
 "What is your favorite day and why?",
 "What's the biggest lie you've ever told?",
 "Describe your relationship with your mother and sister?",
 "Do you think Great Britain should be part of a United Europe?",
 "What's your favorite number? Why?",
 "What qualities are important to you in a boyfriend or girlfriend?",
 "Why didn't Noah swat those two mosquitoes?",
 "What is the most bizarre gift your husband ever gave you?",
 "Seen anything weird lately?",
 "What's a lesson in life you learned the hard way?",
 "What level of importance must a person have, before they are considered assassinated instead of just murdered",
 "Why does it take 15 minutes to cook minute rice?",
 "Have you ever owned a goldfish?",
 "What was Jimmy Stuarts middle name? Crane",
 "Who would you want to be with on a desert island?",
 "Would you rather be a famous director or a famous actor?",
 "What's your favourite author beginning with the letter R?",
 "What's the cleverest word you know?",
 "Is your dad an embarrassing dancer?",
 "Within 3 how many pairs of shoes will your wife say she has?",
 "How would you describe your family culture?",
 "Do you hold grudges?",
 "Which is your favourite body part of the human body and why?",
 "What was the most exciting moment of your life?",
 "What's your favorite pizza topping?",
 "What are some of your favorite books?",
 "Would you rather be an amazing dancer or an amazing singer?",
 "How often do you go on vacation?",
 "If you could change 3 things about your country, what would you change?",
 "Were Mary and Joseph's surname Christ before Jesus was born?",
 "If you had to change jobs with one of your friends, who would you choose?",
 "Have you brushed your teeth lately?",
 "What was Spencer Tracy's last movie role? Guess who's coming to dinner",
 "Why do toasters always have a setting that burns the toast to a horrible crisp which no decent human being would eat?",
 "Have you ever dialed the talking clock?",
 "What nicknames do you have/have had?",
 "Where would your dream vacation be?",
 "What color was the front door on the first place you lived together?",
 "How much cash is your husband carrying with him right now?",
 "If you were going to go to the movies alone, what would be the perfect film for you to watch by yourself?",
 "At The Beach Would You Rather Play In The Sand, Or Play In The Water?",
 "Are You A Neat Freak?",
 "How long does it take you to get ready?",
 "What's the best prank you’ve ever pulled?",
 "What was your first smart phone? How did you feel when you got it?",
 "I wish my spouse would stop __________________.",
 "Crowds Or Small Groups?",
 "Do You Wear A Lot Of Jewelry?",
 "If yes how many and who were they with?",
 "Why did you break up with her?",
 "What are the handles for corn on the cob called?",
 "Are You Good At Computer Games?",
 "What was Clint Eastwood's first film as a director? Play Misty for Me",
 "Did You Have A Good Birthday Last Year?",
 "Can you remember who gave you the best sex of your life?",
 "Can you blow bubbles with bubblegum?",
 "What do you like to talk about when on a date?",
 "Last furry thing you touched?",
 "Do You Have A Role Model?",
 "Complete the following sentence: \"A perfect wife is one who _____________\"",
 "Would you rather forget who you were or who everyone else was?",
 "Have you watched Sex in the city?",
 "What was the last thing you did that caused your wife to give you the evil eye?",
 "Do You Love Trips In The Wild?",
 "If Wile E coyote has enough money to by all that Acme crap why doesn't he buy his dinner?",
 "Have you ever chased down an ice cream truck as an adult?",
 "Black or white?",
 "Do You Have A Workout Routine? What Is It?",
"What do you do for fun?",
 "If quizzes are quizzical, what are tests?",
 "If you were going to go to the movies alone, what would be the perfect film for you to watch by yourself?",
 "On a scale of 1-10 how random would you say these are?",
 "After 50 years acting, who was given an honorary Oscar in 1985? James Stewart",
 "Which would you choose: money, or love?",
 "What is the most embarrassing thing you've ever done?",
 "What do you think is the most important thing in your life?",
 "You and your girlfriend are going to watch a movie, what three types of movies would you choose?",
 "What do you do when you are bored?",
 "What kind of music do you like most?",
 "What is your major goal in life?",
 "and what would your special move be called?",
 "Are You A Kissable Person?",
 "If one synchronized swimmer drowns, do the rest drown too?",
 "Do you keep or maintain a blog?",
 "Have you used cocaine?",
 "What is the craziest diet you've heard of?",
 "Do you prefer me wearing makeup or none at all?",
 "Can you touch your nose with your tongue?",
 "Do You Like Getting Wet In The Rain?",
 "Which 3 parts of your body would you love to be massaged most?",
 "When is your spouse least appealing to you? The most appealing?",
 "Records, tapes, CDs, MP3s. Which did you grow up with? What is good and bad about each?",
 "What is something you've always wanted to try but have been too scared to?",
 "Do you own a bike?",
 "What do you wear in bed?",
 "First Celebrity Crush?",
 "How old were you when you started dating?",
 "What would you bring along to an idyllic picnic?",
 "At what point are we good enough? When are we self-improved enough to accept ourselves?",
 "What two things could you not do when you were younger?",
 "Do you have any old friends who wish you could meet up with again?",
 "If a mute child swears, does his mother make him wash his hands with soap?",
 "If you could be trained up in any profession of your choice by top professionals what profession would you choose?",
 "What do you call it when fat people swim naked?",
 "Do You Have Curly Hair?",
 "Would you rather play basketball or hockey?",
 "What do you like watching the most on television?",
 "What would be your strategy for surviving an apocalyptic epidemic?",
 "Have you ever cheated someone?",
 "Who are 3 of your biggest inspirations?",
 "Would you rather end hunger or hatred?",
 "Have Any Celebrity Crushes?",
 "Do You Like Music? If So What Kind?",
 "How do you know your spouse is in the mood for making love?",
 "If you HAD to change your name, what would you change it to?",
 "Would you like to spend your honeymoon on a remote island?",
 "Have you read 50 Shades Of Grey? If so, did it turn you on?",
 "What if any unusual objects have you swallowed?",
 "What time is bed time?",
 "What is your favorite family memory?",
 "Do You Take Showers In The Morning Or At Night More?",
 "Would you rather have a missing finger or have an extra toe?",
 "In some books, why do they have blank pages at the very end?",
 "If it's zero degrees outside today and it's supposed to be twice as cold tomorrow, how cold is it going to be?",
 "Would you rather only be able to jump everywhere you go or only be able to walk on your hands?",
 "Ever had a drunken night in Mexico?",
 "Do you lick the yogurt or desert lid?",
 "Who in your life always stresses you out and who do you rely on to help you calm down?",
 "What's the largest amount of money you've had to borrow off of a friend or family member",
 "Ever Seen A Therapist?",
 "What explorer introduced pigs to North America? Christopher Columbus.",
 "You know how most packages say \"Open here\". What is the protocol if the package says, \"Open somewhere else\"?",
 "What do you think of homeschooling?",
 "How many pairs of shoes do you own?When is your birthday?",
 "How important does a person have to be before they are considered assassinated instead of just murdered?",
 "Do you do your utmost for the environment?",
 "What are some of your favorite websites?",
 "Which Has Been Your Best Vacation So Far? What Made It So Special?",
 "Are You Are A Compulsive, Impulsive Shopper?",
 "What are your other favorite songs?",
 "If Wile E. Coyote had enough money to buy all that Acme crap, why didn't he just buy dinner?",
 "Do you have a tattoo?",
 "Have you been naughty and had sex in a public place? Did you get caught?",
 "If you choke a Smurf, what color does it turn?",
 "What animal best represents you? why?",
 "Have you ever tried to make your own alcohol?",
 "Harold Sakata was badly burned playing what character? Odd Job in Goldfinger",
 "If you mated a Bulldog with a Shitsu would you get a ***?",
 "If you could be any famous person who would you be and why?",
 "What is something most people do easily but you find very difficult?",
 "Why do we wash bath towels? Aren't we clean when we use them?",
 "Would you rather wear clown shoes every day or a clown wig every day?",
 "What movie scene choked you up the most?",
 "Do You Snore Or Steal The Covers Or Roll Around In Your Sleep?",
 "What does your spouse's sexiest pajamas look like?",
 "What is your spouse's favorite movie theater snack?",
 "Where was your first kiss?",
 "Who was better, Flipper, Lassie or Skippy?",
 "Have you watched Sex in the city?",
 "Did you watch or read 50 shades of grey, and if you did, did it turn you on?",
 "Have You Ever Sat By The Phone All Night Waiting For Someone To Call?",
 "How often do you see your parents? How about your extended family?",
 "Is the male or female body the closest to perfection?",
 "Do you think there is something special about a person’s first love? Why?",
 "Why is there not a special name for the tops of your feet?",
 "William Hurt won the best actor Oscar for what 1985 movie? The Kiss of the Spiderwoman",
 "When you buy something new do you get a desire to use/play with it even when they dont have any physical application yet?",
 "How does the guy who drives the snowplow get to work?",
"Was Jesus a virgin when he died?",
 "Do You Regret Living Those Intimate Experiences With That Person?",
 "How often do you go on vacation?",
 "Have you ever starred in a school play?",
 "Can you somersault?",
 "Tell me about a sporting event you’ll never forget",
 "How tall is the tallest person you know?",
 "Do You Have Any Siblings? If Yes, Are They Older/Younger To You? Are They Male Or Female?",
 "How would you react if the doctor told me that I have a deadly disease? Would you still love me?",
 "Which song best describes your first date? Sea of Love, Maneater, Separate Ways, Our Lips are Sealed, or Cold as Ice",
 "What did you call your grandparents?",
 "Ever tried to get skinny dipped?",
 "What is the craziest sexual position you have pulled off?",
 "Are You Mostly A Clean Or Messy Person?",
 "How much time do you spend on Yahoo?",
 "When did you last give your wife flowers?",
 "What size shoe would you buy your husband?",
 "Pirate downloads, good or bad?",
 "Charlie Chaplin was the first actor to appear on the cover of what? Time magazine",
 "Would you date someone significantly (9 years or over) older than you?",
 "Are there any groups of people you just can't stand?",
 "What scares you the most and why?",
 "Do You Think People Should Have Cosmetic Surgery To Enhance Their Looks?",
 "Do you believe the Governments hide technology and information from the public?",
 "If some of the lesser known holidays were commercialized, what would the commercialization look like?",
 "Do You Own Or Use A Desktop Computer Or A Laptop?",
 "Tell me about someone you really admire?",
 "Do you prefer Honey or Jam?",
 "How much time do you spend on MySpace?",
 "Would you let me slap you for a hundred dollars?",
 "What is truth?",
 "When do you feel best?",
 "Democracy, good or bad?",
 "What are the things you always take with you?",
 "What's the silliest invention you have heard of?",
 "What animal would your spouse choose to be?",
 "Do you like to try new things?",
 "How do you feel about my family?",
 "What fact amazes you every time you think of it?",
 "What was the last movie you saw?",
 "Where are 3 places you would like to visit on holiday and why?",
 "Would you like to have a naughty chat?",
 "How old were you when you started dating?",
 "What is your favorite food with them?",
 "Why is a boxing ring square?",
 "Where will your spouse say they had the best vacation with you?",
 "Why do women tolerate \"you guys\" when men would never go for \"you girls\"?",
 "Do you like pets?",
 "Why does Jello have a smell when you add the powder in the water, but when it \"gels\" the smell is gone?",
 "If you mated a bull dog and a shitsu, would it be called a bullshit?",
 "When we argue, my wife always puts her __ in my __.",
 "Who was the first filmed recipient of the \" Custard Pie\" in 1913? Fatty Arbuckle",
 "Gerald Thomas directed what series of films? Carry on Films",
 "What are you most passionate about?",
 "What place would you like to visit that you haven't been to yet?",
 "What is on the walls of the room you are in?",
 "Do you miss someone a lot right now?",
 "What's your opinion on rats?",
 "If you were in a witness protection program, what would be your new name and where would you go?",
 "Are You More Like Your Mom Or Your Dad?",
 "How Do You Feel About Cigarette Smoking?",
 "What is your favorite quote?",
 "What is your current desktop picture?",
 "Why do we press harder on a remote control when we know the batteries are flat?",
 "What's your favourite Nursery Rhyme?",
 "Do you know CPR?",
 "Favorite things to do alone?",
 "What was your first job?",
 "Why don't sheep shrink when it rains?",
 "If money doesn't grow on trees then why do banks have branches?",
 "If corn oil is made from corn, and vegetable oil is made from vegetables, then what is baby oil made from?",
 "How tall do you want your mate to be?",
 "Who has had the most influence in your life?",
 "Can you solve sudoko puzzles?",
 "Do you have a fetish that you would like to employ in your next relationship?",
 "Where do people in Hell tell other people to go?",
 "How many slices of pizza are you capable of eating in one sitting?",
 "Would you rather live in the country or in the city?",
 "What would your most wicked fantasy be?",
 "Do you like reading?",
 "What color is your wife's toothbrush?",
 "Would you rather love and not be loved back, or be loved but never love?",
 "What friend of your spouse annoys you the most?",
 "You are in charge of making insects a popular food item. You have 1 billion US dollars to achieve your goal. How do you do it?",
 "What's your favourite sportswear brand?",
 "If you could be trained up in any profession of your choice by top professionals what profession would you choose?",
 "Do you have a tattoo on your body?",
 "Do you smoke?",
 "What type of gun does James Bond use? A Walther PPK",
 "What do you know about the history of some holidays?",
 "Who hogs the bed covers?",
 "If a person with multiple personalities threatens suicide, is that considered a hostage situation?",
 "What is one food you will never give up?",
 "Have You Ever Broken Someone's Heart?",
 "Which is the one job in the world that you would love to do?",
 "Ever Sold Blood?",
 "If a firefighter fights fire and a crime fighter fights crime, what does a freedom fighter fight?",
 "What actor was known as Singing Sandy early in his career? John Wayne",
 "Do you know anyone who has lost a lot of weight on a diet? Have they keep the weight off?",
 "Can you solve sudoku puzzles?",
"What would your dream car be?",
 "Do you prefer summer or winter activities?",
 "Can you \"stare off into space\" when you're in space?",
 "But when you take him in a car, he sticks his head out the window!",
 "Have you ever felt jealous when you saw me talking to another guy?",
 "How old were you when you made out first?",
 "What famous Hollywood star once said \"men are creatures with two legs and 8 hands\"? Jayne Mansfield",
 "What is a controversial opinion do you have?",
 "Been in a mosh pit?",
 "Can You Share 3 Good Points About Me?",
 "Is there anything you're superstitious about?",
 "Have you ever been to an Art gallery?",
 "Can you do 10 revolutions of a hula hoop?",
 "How Do You Feel About Porn?",
 "Is family important to you?",
 "What would you change about me if you could?",
 "If milk goes bad if not refrigerated, does it go bad if the cow isn’t refrigerated?",
 "Does Robert De Niro know that it's okay to turn down roles?",
 "If you could speak any language you want to speak, what would it be?",
 "What was Hitchcock's first color film? Rope",
 "Would you rather be born with an elephant trunk or a giraffe neck?",
 "If electricity comes from electrons, does morality come from morons?",
 "Do You \"Go Dutch\" When Dating?",
 "Do you do drugs or have you ever done drugs?",
 "If a relative died and left you a million dollars, what would you do with the money?",
 "Do you know anything about carbon footprints?",
 "What color is your wife's eyes?",
 "Do you say \"Zee\" or \"Zed\" to describe the letter Z?",
 "If you could have one superpower, what would it be and why?",
 "Do you like reality TV programs?",
 "Do Jewish vampires avoid crosses or Stars of David?",
 "When playing checkers or chess do you prefer to be black or white?",
 "What's your favorite day of the year?",
 "In the Pink Panther, what did Peter Sellers use as an ink blotter? A Cat",
 "Have you already thought about your babies names?",
 "Have You Ever Had A Long Lasting Disease?",
 "What's the worst thing that's ever happened to you?",
 "How many car accidents have you been in? How many were your fault?",
 "Would you rather never use social media sites / apps again or never watch another movie or TV show?",
 "Have you ever had sex with your best friend's girlfriend?",
 "How many girls or guys you have kissed?",
 "Shirley Schrift found fame and success as which actress? Shelly Winters",
 "List 3 of your best personality traits.",
 "What is your best physical feature?",
 "Who all are there in your family?",
 "What did The Groom say he's most excited about being married to you?",
 "If you had just 5 minutes left to live, what would you do?",
 "What's your favourite body part beginning with the letter G?",
 "If you and your husband were to go get a new dog, what dog would he want to get?",
 "Why do you need a driver's license to buy liquor when you can't drink and drive?",
 "What is your most embarrassing sexual experience?",
 "If you told your wife that tomorrow you would do any one item from her Honey-Do list, what would she choose?",
 "Which part of you that you hate the most?",
 "Would you rather accidentally be responsible for the death of a child or accidentally be responsible for the deaths of three adults?",
 "Are You Are A Compulsive, Impulsive Shopper?",
 "How do you wish your life turned out?",
 "Are you a risk taker? If yes, what kind of risks had you taken? If not, why not?",
 "What's your favourite biscuit to dunk?",
 "Do You Believe In True Love?",
 "Are you a good public speaker?",
 "Which are your favorite animals? why?",
 "Do You Consider It More Important To Be Liked Or Respected? Why?",
 "What is your biggest success? How about your biggest failure?",
 "Do you love wild sex?",
 "Have you ever turned a failure into a win?",
 "If you could meet someone famous, who would it be?",
 "What's the largest amount of money you've ever won?",
 "Why do banks leave the door wide open but the pens chained to the counter?",
 "What's your favourite bodypart beginning with the letter G?",
 "Do you have a T.V. in your bedroom?",
 "Would you rather be in a dark and scary room for days all by yourself or be in a well-lit room alone with Michael Jackson?",
 "Have you ever had sex in public?",
 "How much did you (husband) spend on your first date?",
 "Can you roll your R's?",
 "Do the actors on Unsolved Mysteries ever get arrested because they look just like the criminal they are playing?",
 "How much legal protection should journalists have?",
 "Favorite College Football Team?",
 "What chokes you up when you think about it?",
 "Which is your favorite college football team?",
 "What was one of the best days of your life?",
 "Tell me about something you've achieved?",
 "Why do we sing \"Take Me Out to the Ballgame\" when we're already there?",
 "Did your parents spoil you as a child?",
 "Do you watch the news on TV?",
 "How do you visualize the perfect man?",
 "What two things could you not do when you were younger?",
 "Have you ever woken the neighbors because you were so loud in the bedroom?",
 "What have you learned today?",
 "What's the most orgasmic thing a woman can do to you?",
 "Would you reveal a deep dark secret about your partner for a million dollars?",
 "When and where was your first kiss?",
 "If you had to eat 1 thing for the rest of your life, what?",
 "What is the fanciest restaurant you have eaten at?",
 "What percentage of the house work would your spouse say they do?",
 "Which is the song that makes you cry?",
 "Have you ever been caught while in action?",
 "Why does someone believe you when you say there are four billion stars, but check when you say the paint is wet?",
 "On a scale from 1-10 what's the highest level of pain you've ever been in?",
 "How long can you balance on one foot?",
 "If you had only one year left to live, what would you do? Why?",
"What is the stupidest thing you've done because someone dared you to?",
 "Who hogs the bed covers?",
 "Who was the last person you rode in the car with that was under 21?",
 "Why can't donuts be square?",
 "Do you think you're a good judge of character?",
 "If you could have sex with any three people you chose, who would they be?",
 "What compulsions do you have?",
 "Do you exercise regularly?",
 "What would Geronimo say if he jumped out of an airplane?",
 "Why do we say \"heads up\" when we mean \"duck\"?",
 "Have you ever had an orgasm without being touched?",
 "If you could level up humans as a species, what stat or ability would you increase?",
 "How many partners have you had?",
 "Do you like marmite? Did you ever win any sports day events?",
 "If you win this title, how would you promote yourself to the world?",
 "Do You Have A Dream Job?",
 "ok – so you can only have one type of sex for the rest of your life – oral, anal, or regular. Which one do you pick?",
 "Why doesn't baking soda freeze?",
 "What do you call male ballerinas?",
 "If Superglue is so good why doesn't it stick to the inside of the tube?",
 "If it's zero degrees outside today and it's supposed to be twice as cold tomorrow, how cold is it going to be?",
 "What is your general philosophy of life?",
 "What do you do when you are bored?",
 "First thing you will save in a fire?",
 "Describe Yourself In 3 Words.",
 "What is The Groom's favourite Christmas movie to watch?",
 "Is it okay for one partner in a couple to take a vacation alone?",
 "What outfit would you wear?",
 "What do you hope to achieve in your professional life?",
 "What are the qualities that draw you to people that you can base a friendship on?",
 "What was your first car? (or what would you like it to be?)",
 "How should success be measured? By that measurement, who is the most successful person you know?",
 "When was the last time you really panicked?",
 "Do you wish there were more or less holidays? Why?",
 "What high level job do you think you could lie your way into with no experience and no one would notice?",
 "What would be your questions to ask on a first date?",
 "If you were captain of a ship, what would you call it?",
 "Where would you find the world's most ancient forest? Daintree Forest, north of Cairns, Australia.",
 "What is the most embarrassing piece of clothing you own?",
 "If your husband had one day off to himself, what would he do?",
 "Who would you want to play you in a movie of your life?",
 "What is your weirdest \"quirk\"?",
 "What's the best compliment you've ever received?",
 "What's your lucky number?",
 "How much time do you spend on Yahoo?",
 "Do you drink?If yes, how often?",
 "Have ex-civil lawyers been distorted?",
 "At What Age Do You Plan To Get Married?",
 "What classic film was called production 9401 during filming? Psycho",
 "If you had to eat 1 thing for the rest of your life, what would it be?",
 "Is teaching a skill that can be taught?",
 "Have You Ever Eated Crocodile Or Snake Meat?",
 "If we could screen babies for psychopathic or sociopathic tendencies, should we? What should we do with the babies that are likely become psychopaths?",
 "Do You Love The Last Girl You Were Talking To?",
 "Why do you think there are so many diet trends?",
 "Why do we drive on parkways and park on driveways?",
 "Do you want a church wedding?",
 "When was the last time you bought your wife flowers?",
 "What is your most favorite and least favorite word and why?",
 "Would you rather share a cubicle with a noisy colleague or a nosy colleague?",
 "Who would you cast to play your spouse in a movie?",
 "What do you think of right before bedtime?",
 "In the movie industry, what is a flipper often used by child actors? False teeth",
 "What flavour of cake did you have at your wedding?",
 "If someone else’s child was being an annoying little runt would you go tell them off or do something about it?",
 "Would you ever walk around wearing men/women's underwear?",
 "Have you ever sold blood?",
 "What's your earliest memory?",
 "Would like to have pets someday?",
 "What's your favorite position when you're on top?",
 "Breakfast at Tiffany's is a famous film, but who wrote the book? Truman Capote",
 "Do you buy people presents to bring back when you go on holiday?",
 "What is most important in life?",
 "Do You Follow Trends?",
 "What are the three things that make you happy instantly?",
 "What was the last thing that got you excited?",
 "Who's your favourite celeb with the same first name or surname as you?",
 "Approx How Big (Sq Feet) Is Your House/Condo/Apartment, Etc?",
 "Have Any Of Your Past Partners Ever Had A Disease?",
 "Have you ever seen me talking to another guy and it made you jealous?",
 "Ever been in true love?",
 "What apps have changed your life a lot?",
 "Favorite things to do alone?",
 "Who won the best su George Burns",
 "What happens to an irrisitable force when it hits an immovable object?",
 "Who's the funniest person you know?",
 "Have you ever been so drunk that you blacked out?",
 "Do you have any kids?",
 "Do You Have A Birthmark And If You Do Where Is It?",
 "What method of education is best? Public school? Private school? Home school?",
 "What is the first thing your husband notices about a girl?",
 "What health benefits does a good massage give you?",
 "Is it OK to use the AM radio after noon?",
 "What is the shortest time it has taken you to orgasm?",
 "Do you say \"Zee\" or \"Zed\" to describe the letter Z?",
 "Do You Believe In Destiny?",
 "What was Norman Bates hobby in Psycho? Stuffing birds",
 "If your life had a mascot, what would the mascot be?",
 "Would you rather eat poison ivy or a handful of bumblebees?",
 "What shirt are you wearing?",
"Are you finding this time together fun?",
 "Why do you have to \"put your two cents in\". but it's only a \"penny for your thoughts\"? Where's that extra penny going to?",
 "What would be your dream sandwich?",
 "How many rooms does your house have?",
 "What was it your spouse that made you realize that they were \"the one\"?",
 "What is the weirdest thing you will ever admit to having done in the past?",
 "Chocolate or Vanilla?",
 "Were you a member of any celebrity fanclub?",
 "If you were comfortably rich would you work hard for more or rest on your laurels?",
 "Have You Ever Found Yourself Attracted To Someone Of The Same Gender?",
 "Which of your husband's possessions does he treasure the most?",
 "Have you ever done it at your grandparent's?",
 "What's your favourite sportswear brand?",
 "If a cat always lands on its feet, and buttered bread always lands butter side down, what would happen if you tied buttered bread on top of a cat?",
 "Do people in prison celebrate halloween.... if so how?",
 "Why do birds not fall out of trees when they sleep?",
 "How do you define poise?",
 "Will humans spread out among the stars or just be a brief blip in Earth's history?",
 "Do you correct peoples mistakes?",
 "What do you like on your toast?",
 "Last thing you made with your own hands?",
 "Do you prefer me wearing makeup or none at all?",
 "Ever Milked A Cow?",
 "Are you / do you want to / have graduated from college?",
 "What are the 3 most important things in a kitchen and why?",
 "Have you ever felt jealous when you saw me talking to another guy?",
 "Can a black person join the kkk?",
 "Have you done anything overly extreme this year?",
 "What movie or book character are you most similar to?",
 "If corn oil is made from corn and vegetable oil is made from vegetables. What is baby oil made from?",
 "Have you ever had a crush on a friend's parent?",
 "What clothing does your spouse wear that looks best on him/her?",
 "What does \"new and improved\" say about the old product?",
 "What do you usually do when the clock turns 10:10?",
 "Can I trust you with my secrets?",
 "Which are your 3 favorite movies and your favorite scenes in it?",
 "Tell me about the worst punishment you had when you were a child?",
 "If you could go back in time to one point in your life, where would you go?",
 "If you could relive the last five years of your life, what would you change?",
 "When was the last time you cried?",
 "What do you do for school and work?",
 "What is your spouse's favorite TV show?",
 "What would your special move be called?",
 "What did you do on your last vacation?",
 "Which is the place/country that you want to visit?",
 "Why are there seeds in seeded grapes, but no bones in a boned fillet?",
 "If you could speak any language you want to speak, what would it be and why?",
 "What's your opinion on rats?",
 "Have You Been Tested For Std's?",
 "Do you have a personal website you would like people to visit?",
 "Do you prefer sunrises or sunsets?",
 "Can you narrate to me your proudest moment?",
 "Which of your wife's friends likes to gossip the most?",
 "Why do fat chance and slim chance mean the same thing?",
 "If London Bridge is standing why is there a song about it falling down?",
 "How important is your family to you?",
 "What's your favourite precious stone?",
 "Can you share 3 strong points about yourself?",
 "Have you ever had sex while at school?",
 "Do you love your job?",
 "Do you believe that a soulmate exists for every person?",
 "What's the silliest thing your spouse has ever done?",
 "What's the highest hill or mountain you've ever climbed?",
 "What's your favourite brand of newspaper?",
 "Can you solve sudoku puzzles?",
 "Would you rather have a mens top half and a womens bottom half or visa versa?",
 "Who is the oldest person you've had sex with?",
 "Why is the sky blue?",
 "What is the most disgusting habit some people have?",
 "What's better? Center Parks or Butlins?",
 "Why does a round pizza come in a square box?",
 "You can have one of the following two things: trust/love?",
 "Have you ever painted a house?",
 "Where were you on Valentine's day?",
 "Talk about a time when you got into trouble at school.",
 "How many Cell Phones do you own?",
 "What turns you off?",
 "Are you the same person you were as a child, or much different?",
 "Who is your next door neighbor?",
 "Who is more of a dancer types among you guys?",
 "Do you think people are basically bad or basically good?",
 "Who inspires you? Who do you aspire to be like?",
 "Define success?",
 "Why is it that people say they \"slept like a baby\" when babies wake up like every two hours?",
 "Do you like singing in the shower?",
 "If a job is cancelled, do hit men get a kill fee?",
 "Are You A Shopaholic Or No?",
 "Which way does a compass point in space?",
 "What would you do in a world war situation?",
 "What is the most important object you own?",
 "Why is there a disclaimer on the Allstate Auto Insurance commericals that says \"Not available in all states\"?",
 "When lightning strikes the ocean why don't all the fish die?",
 "Marilyn Monroe's real last name was what? Mortenson",
 "What upsets you most in a relationship and what makes you the happiest?",
 "If you could be any sports player, who would it be?",
 "Are you a good actor?",
 "What do you call it when fat people swim naked?",
 "Ever Had A Crush On A Member Of The Same Gender?",
 "What is the most distant place you've visited (from your home)?",
 "What are the last 4 digits in your cellphone number?"
]